import { Link } from 'react-router-dom'

export default function PrivecyPolicy() {
    return (
        <div className="p-4 max-w-xl mx-auto">
            <h2 className="text-2xl font-bold text-gray-800 mb-4">🔒 গোপনীয়তা নীতি</h2>

            <p className="text-gray-700 mb-4">
                <strong>bazarbhai.com (বাজারভাই ডট কম)</strong> গ্রাহকদের তথ্যের গোপনীয়তা রক্ষা করতে প্রতিশ্রুতিবদ্ধ। আপনার ব্যক্তিগত তথ্য আমাদের কাছে নিরাপদ এবং কেবলমাত্র সেবার মান উন্নয়নের জন্য ব্যবহৃত হয়।
            </p>

            <ol className="list-decimal list-inside text-gray-700 space-y-2">
                <li>
                    আমরা কেবলমাত্র আপনার নাম, মোবাইল নম্বর, ঠিকানা এবং অর্ডার সম্পর্কিত তথ্য সংগ্রহ করি — যাতে আপনার অর্ডার সময়মতো পৌঁছাতে পারে।
                </li>
                <li>
                    এই তথ্য কোন তৃতীয় পক্ষের সাথে ভাগ করা হয় না, ব্যতীত যখন আইনি কারণে বাধ্য হতে হয়।
                </li>
                <li>
                    আপনার তথ্যের নিরাপত্তা নিশ্চিত করতে আমরা সর্বোচ্চ প্রচেষ্টা করি এবং এটি কোনোভাবেই বিক্রি বা শেয়ার করি না।
                </li>
                <li>
                    আমাদের লক্ষ্য হলো গ্রামবাংলার মানুষকে ঘরে বসেই জরুরি জিনিসপত্র সহজে পৌঁছে দেওয়া, এবং এর জন্য আমরা প্রযুক্তিকে মানুষের কল্যাণে ব্যবহার করি।
                </li>
                <li>
                    ভবিষ্যতে, আমাদের সেবায় কোনো পরিবর্তন এলে, এই নীতিতে আপডেট করা হবে এবং গ্রাহকদের জানানো হবে।
                </li>
            </ol>

            <p className="text-gray-700 mt-4">
                আপনার গোপনীয়তা আমাদের কাছে গুরুত্বপূর্ণ। যদি আপনার কোনো প্রশ্ন বা উদ্বেগ থাকে, অনুগ্রহ করে আমাদের সাথে

                <Link to="/contact-us" className='text-blue-400 underline ml-1 underline-offset-4'>
                    যোগাযোগ করুন
                </Link> ।
            </p>
        </div>
    )
}
